protogia/avr-descriptionfiles-4-nim/svd/ATmega128.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BOOT_LOAD</name>
      <description>Bootloader</description>
      <baseAddress>0x00000068</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store Program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLBSET</name>
              <description>Boot Lock Bit Set</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSRE</name>
              <description>Read While Write section read enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSB</name>
              <description>Read While Write Section Busy</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPMIE</name>
              <description>SPM Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x00000054</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1B</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>INT1</name>
        <description>External Interrupt Request 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>INT2</name>
        <description>External Interrupt Request 2</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>INT3</name>
        <description>External Interrupt Request 3</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>INT4</name>
        <description>External Interrupt Request 4</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>INT5</name>
        <description>External Interrupt Request 5</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>INT6</name>
        <description>External Interrupt Request 6</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>INT7</name>
        <description>External Interrupt Request 7</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMP</name>
        <description>Timer/Counter2 Compare Match</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_OVF</name>
        <description>Timer/Counter2 Overflow</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter Compare Match B</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMP</name>
        <description>Timer/Counter0 Compare Match</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>SPI_STC</name>
        <description>SPI Serial Transfer Complete</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>USART0_RX</name>
        <description>USART0, Rx Complete</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>USART0_UDRE</name>
        <description>USART0 Data Register Empty</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>USART0_TX</name>
        <description>USART0, Tx Complete</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion Complete</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>EE_READY</name>
        <description>EEPROM Ready</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>ANALOG_COMP</name>
        <description>Analog Comparator</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPC</name>
        <description>Timer/Counter1 Compare Match C</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_CAPT</name>
        <description>Timer/Counter3 Capture Event</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPA</name>
        <description>Timer/Counter3 Compare Match A</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPB</name>
        <description>Timer/Counter3 Compare Match B</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPC</name>
        <description>Timer/Counter3 Compare Match C</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_OVF</name>
        <description>Timer/Counter3 Overflow</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>USART1_RX</name>
        <description>USART1, Rx Complete</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>USART1_UDRE</name>
        <description>USART1, Data Register Empty</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>USART1_TX</name>
        <description>USART1, Tx Complete</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>TWI</name>
        <description>2-wire Serial Interface</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>SPM_READY</name>
        <description>Store Program Memory Read</description>
        <value>34</value>
      </interrupt>
      <registers>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVCE</name>
              <description>Interrupt Vector Change Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SM2</name>
              <description>Sleep Mode Select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRW10</name>
              <description>External SRAM Wait State Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRE</name>
              <description>External SRAM Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCSR</name>
          <description>MCU Control And Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on reset flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Value</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPZ</name>
          <description>RAM Page Z Select Register</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RAMPZ0</name>
              <description>RAM Page Z Select Register Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDIV</name>
          <description>XTAL Divide Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XDIV0</name>
              <description>XTAL Divide Select Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XDIV1</name>
              <description>XTAL Divide Select Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XDIV2</name>
              <description>XTAL Divide Select Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XDIV3</name>
              <description>XTAL Divide Select Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XDIV4</name>
              <description>XTAL Divide Select Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XDIV5</name>
              <description>XTAL Divide Select Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XDIV6</name>
              <description>XTAL Divide Select Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XDIVEN</name>
              <description>XTAL Divide Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XMCRA</name>
          <description>External Memory Control Register A</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRW11</name>
              <description>Wait state select bit upper page</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRW0</name>
              <description>Wait state select bit lower page</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAIT_STATES</name>
                  <description>No wait-states</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_ONE_CYCLE_DURING_READ_WRITE_STROBE</name>
                  <description>Wait one cycle during read/write strobe</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_STROBE</name>
                  <description>Wait two cycles during read/write strobe</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_AND_WAIT_ONE_CYCLE_BEFORE_DRIVING_OUT_NEW_ADDRESS</name>
                  <description>Wait two cycles during read/write and wait one cycle before driving out new address</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRL</name>
              <description>Wait state page limit</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LS_N_A_US_0X1100_0XFFFF</name>
                  <description>LS = N/A, US = 0x1100 - 0xFFFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X1FFF_US_0X2000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x1FFF, US = 0x2000 - 0xFFFF</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X3FFF_US_0X4000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x3FFF, US = 0x4000 - 0xFFFF</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X5FFF_US_0X6000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x5FFF, US = 0x6000 - 0xFFFF</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X7FFF_US_0X8000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x7FFF, US = 0x8000 - 0xFFFF</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X9FFF_US_0XA000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x9FFF, US = 0xA000 - 0xFFFF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0XBFFF_US_0XC000_0XFFFF</name>
                  <description>LS = 0x1100 - 0xBFFF, US = 0xC000 - 0xFFFF</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0XDFFF_US_0XE000_0XFFFF</name>
                  <description>LS = 0x1100 - 0xDFFF, US = 0xE000 - 0xFFFF</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XMCRB</name>
          <description>External Memory Control Register B</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XMM</name>
              <description>External Memory High Mask</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XMBK</name>
              <description>External Memory Bus Keeper Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
